Amiya200/stm32_water_tank/Core/Src/screen.c
static void show_twist_off_sec(void){
    lcd_line0("TWIST OFF SEC");
    lcd_val_next_int(edit_twist_off_s);
}

static void show_twist_on_h(void){
    lcd_line0("TWIST ON HH");
    lcd_val_next_int(edit_twist_on_hh);
}

static void show_twist_on_m(void){
    lcd_line0("TWIST ON MM");
    lcd_val_next_int(edit_twist_on_mm);
}

static void show_twist_off_h(void){
    lcd_line0("TWIST OFF HH");
    lcd_val_next_int(edit_twist_off_hh);
}

static void show_twist_off_m(void){
    lcd_line0("TWIST OFF MM");
    lcd_val_next_int(edit_twist_off_mm);
}

/* ================================================================
   COUNTDOWN UI
   ================================================================ */

static void show_countdown(void){
    char l0[17], l1[17];

    if (countdownActive){
        uint32_t sec = countdownDuration;
        uint32_t min = sec / 60;
        uint32_t s   = sec % 60;

        snprintf(l0,sizeof(l0),"CD %02u:%02u RUN",min,s);
        snprintf(l1,sizeof(l1),"Press to STOP");
    } else {
        snprintf(l0,sizeof(l0),"CD Set:%3u min",edit_countdown_min);
        snprintf(l1,sizeof(l1),"Press to START");
    }

    lcd_line0(l0);
    lcd_line1(l1);
}

static void show_countdown_edit_min(void){
    lcd_line0("SET MINUTES");
    lcd_val_next_int(edit_countdown_min);
}

/* ================================================================
   NEW SETTINGS UI (OPTION-B)
   ================================================================ */

static void show_settings_gap(void){
    lcd_line0("DRY GAP (s)");
    lcd_val_next_int(edit_settings_gap_s);
}

static void show_settings_retry(void){
    lcd_line0("RETRY COUNT");
    lcd_val_next_int(edit_settings_retry);
}

static void show_settings_uv(void){
    lcd_line0("UV CUT (V)");
    lcd_val_next_int(edit_settings_uv);
}

static void show_settings_ov(void){
    lcd_line0("OV CUT (V)");
    lcd_val_next_int(edit_settings_ov);
}

static void show_settings_ol(void){
    lcd_line0("OVERLOAD (A)");
    lcd_val_next_float(edit_settings_ol);
}

static void show_settings_ul(void){
    lcd_line0("UNDERLOAD (A)");
    lcd_val_next_float(edit_settings_ul);
}

static void show_settings_maxrun(void){
    lcd_line0("MAX RUN (min)");
    lcd_val_next_int(edit_settings_maxrun);
}

static void show_settings_factory(void){
    lcd_line0("FACTORY RESET?");
    lcd_line1(edit_settings_factory_yes ? "val:YES   Next>" : "val:NO    Next>");
}
/***************************************************************
 *  SCREEN.C — PART C / 6
 *  APPLY FUNCTIONS + MENU SELECT ENGINE + SETTINGS FLOW
 ***************************************************************/

/* ================================================================
   APPLY FUNCTIONS
   ================================================================ */

static void apply_timer_settings(void){
    TimerSlot *t = &timerSlots[currentSlot];

    t->onHour    = edit_timer_on_h;
    t->onMinute  = edit_timer_on_m;
    t->offHour   = edit_timer_off_h;
    t->offMinute = edit_timer_off_m;

    t->dayMask   = edit_timer_dayMask;
    t->enabled   = edit_timer_enabled;

    extern void ModelHandle_TimerRecalculateNow(void);
    ModelHandle_TimerRecalculateNow();
}

static void apply_auto_settings(void){
    ModelHandle_SetAutoSettings(
        edit_auto_gap_s,
        edit_auto_maxrun_min,
        edit_auto_retry
    );
}

static void apply_twist_settings(void){
    twistSettings.onDurationSeconds  = edit_twist_on_s;
    twistSettings.offDurationSeconds = edit_twist_off_s;

    twistSettings.onHour   = edit_twist_on_hh;
    twistSettings.onMinute = edit_twist_on_mm;

    twistSettings.offHour  = edit_twist_off_hh;
    twistSettings.offMinute= edit_twist_off_mm;
}

static void apply_countdown_settings(void){
    if (edit_countdown_min == 0)
        edit_countdown_min = 1;

    countdownDuration = (uint32_t)edit_countdown_min * 60u;
}

static void apply_settings_all(void){
    ModelHandle_SetUserSettings(
        edit_settings_gap_s,
        edit_settings_retry,
        edit_settings_uv,
        edit_settings_ov,
        edit_settings_ol,
        edit_settings_ul,
        edit_settings_maxrun
    );

    if (edit_settings_factory_yes)
        ModelHandle_FactoryReset();
}

/* ================================================================
   SETTINGS FLOW (OPTION-B)
   ================================================================ */

static void start_settings_edit_flow(void){
    /* Load existing values */
    edit_settings_gap_s   = ModelHandle_GetGapTime();
    edit_settings_retry   = ModelHandle_GetRetryCount();
    edit_settings_uv      = ModelHandle_GetUnderVolt();
    edit_settings_ov      = ModelHandle_GetOverVolt();
    edit_settings_ol      = ModelHandle_GetOverloadLimit();
    edit_settings_ul      = ModelHandle_GetUnderloadLimit();
    edit_settings_maxrun  = ModelHandle_GetMaxRunTime();
    edit_settings_factory_yes = 0;

    /* Start flow */
    ui = UI_SETTINGS_GAP;
    screenNeedsRefresh = true;
}

static void advance_settings_flow(void){
    switch(ui)
    {
        case UI_SETTINGS_GAP:
            ui = UI_SETTINGS_RETRY;
            break;

        case UI_SETTINGS_RETRY:
            ui = UI_SETTINGS_UV;
            break;

        case UI_SETTINGS_UV:
            ui = UI_SETTINGS_OV;
            break;

        case UI_SETTINGS_OV:
            ui = UI_SETTINGS_OL;
            break;

        case UI_SETTINGS_OL:
            ui = UI_SETTINGS_UL;
            break;

        case UI_SETTINGS_UL:
            ui = UI_SETTINGS_MAXRUN;
            break;

        case UI_SETTINGS_MAXRUN:
            ui = UI_SETTINGS_FACTORY;
            break;

        case UI_SETTINGS_FACTORY:
            apply_settings_all();
            ui = UI_DASH;
            break;

        default:
            ui = UI_DASH;
            break;
    }

    screenNeedsRefresh = true;
}

/* ================================================================
   MENU SELECT HANDLER — Updated For Settings
   ================================================================ */

