Amiya200/stm32_water_tank/Core/Src/screen.c
        case UI_TWIST_EDIT_ON_H:       if(edit_twist_on_hh < 23) edit_twist_on_hh++; break;
        case UI_TWIST_EDIT_ON_M:       if(edit_twist_on_mm < 59) edit_twist_on_mm++; break;
        case UI_TWIST_EDIT_OFF_H:      if(edit_twist_off_hh < 23) edit_twist_off_hh++; break;
        case UI_TWIST_EDIT_OFF_M:      if(edit_twist_off_mm < 59) edit_twist_off_mm++; break;

        /* ---------------- COUNTDOWN ---------------- */
        case UI_COUNTDOWN_EDIT_MIN:    if(edit_countdown_min < 999) edit_countdown_min++; break;

        /* ---------------- SETTINGS (Option-B) ---------------- */
        case UI_SETTINGS_GAP:
            edit_settings_gap_s++;
            break;

        case UI_SETTINGS_RETRY:
            edit_settings_retry++;
            break;

        case UI_SETTINGS_UV:
            if (edit_settings_uv < 500) edit_settings_uv++;
            break;

        case UI_SETTINGS_OV:
            if (edit_settings_ov < 500) edit_settings_ov++;
            break;

        case UI_SETTINGS_OL:
            edit_settings_ol += 0.1f;
            if (edit_settings_ol > 50.0f) edit_settings_ol = 50.0f;
            break;

        case UI_SETTINGS_UL:
            edit_settings_ul += 0.1f;
            if (edit_settings_ul > 50.0f) edit_settings_ul = 50.0f;
            break;

        case UI_SETTINGS_MAXRUN:
            edit_settings_maxrun++;
            break;

        case UI_SETTINGS_FACTORY:
            edit_settings_factory_yes ^= 1;
            break;

        default:
            break;
    }
}

void decrease_edit_value(void){
    switch(ui)
    {
        /* ---------------- TIMER ---------------- */
        case UI_TIMER_EDIT_SLOT_ON_H:  if(edit_timer_on_h > 0) edit_timer_on_h--; break;
        case UI_TIMER_EDIT_SLOT_ON_M:  if(edit_timer_on_m > 0) edit_timer_on_m--; break;
        case UI_TIMER_EDIT_SLOT_OFF_H: if(edit_timer_off_h > 0) edit_timer_off_h--; break;
        case UI_TIMER_EDIT_SLOT_OFF_M: if(edit_timer_off_m > 0) edit_timer_off_m--; break;

        /* ---------------- AUTO ---------------- */
        case UI_AUTO_EDIT_GAP:         if(edit_auto_gap_s > 0) edit_auto_gap_s--; break;
        case UI_AUTO_EDIT_MAXRUN:      if(edit_auto_maxrun_min > 0) edit_auto_maxrun_min--; break;
        case UI_AUTO_EDIT_RETRY:       if(edit_auto_retry > 0) edit_auto_retry--; break;

        /* ---------------- TWIST ---------------- */
        case UI_TWIST_EDIT_ON:         if(edit_twist_on_s > 0) edit_twist_on_s--; break;
        case UI_TWIST_EDIT_OFF:        if(edit_twist_off_s > 0) edit_twist_off_s--; break;

        case UI_TWIST_EDIT_ON_H:       if(edit_twist_on_hh > 0) edit_twist_on_hh--; break;
        case UI_TWIST_EDIT_ON_M:       if(edit_twist_on_mm > 0) edit_twist_on_mm--; break;
        case UI_TWIST_EDIT_OFF_H:      if(edit_twist_off_hh > 0) edit_twist_off_hh--; break;
        case UI_TWIST_EDIT_OFF_M:      if(edit_twist_off_mm > 0) edit_twist_off_mm--; break;

        /* ---------------- COUNTDOWN ---------------- */
        case UI_COUNTDOWN_EDIT_MIN:    if(edit_countdown_min > 1) edit_countdown_min--; break;

        /* ---------------- SETTINGS (Option-B) ---------------- */
        case UI_SETTINGS_GAP:
            if (edit_settings_gap_s > 0) edit_settings_gap_s--;
            break;

        case UI_SETTINGS_RETRY:
            if (edit_settings_retry > 0) edit_settings_retry--;
            break;

        case UI_SETTINGS_UV:
            if (edit_settings_uv > 50) edit_settings_uv--;
            break;

        case UI_SETTINGS_OV:
            if (edit_settings_ov > 50) edit_settings_ov--;
            break;

        case UI_SETTINGS_OL:
            edit_settings_ol -= 0.1f;
            if (edit_settings_ol < 0.1f) edit_settings_ol = 0.1f;
            break;

        case UI_SETTINGS_UL:
            edit_settings_ul -= 0.1f;
            if (edit_settings_ul < 0.1f) edit_settings_ul = 0.1f;
            break;

        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun > 1) edit_settings_maxrun--;
            break;

        case UI_SETTINGS_FACTORY:
            edit_settings_factory_yes ^= 1;
            break;

        default:
            break;
    }
}

/* ================================================================
   MAIN SWITCH HANDLER — with updated SETTINGS logic
   ================================================================ */

void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    uint32_t now = HAL_GetTick();

    bool sw3 = Switch_IsPressed(2);
    bool sw4 = Switch_IsPressed(3);

    /* ------------------- LONG PRESS SPECIALS ------------------- */

    if (b == BTN_RESET_LONG)
    {
        ModelHandle_ToggleManual();
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    /* HOLD UP (SW3) for continuous increment */
    if (sw3 && sw_long_issued[2]) {
        if (now - last_repeat_time >= CONTINUOUS_STEP_MS) {
            last_repeat_time = now;

            if (ui == UI_MENU){
                if (menu_idx > 0) menu_idx--;
            }
            else if (ui == UI_TIMER_SLOT_SELECT){
                if (currentSlot > 0) currentSlot--;
                if (currentSlot < 2) timer_page = 0;
                else if (currentSlot < 5) timer_page = 1;
                else timer_page = 2;
            }
            else {
                increase_edit_value();
            }

            screenNeedsRefresh = true;
        }
    }

    /* HOLD DOWN (SW4) for continuous decrement */
    if (sw4 && sw_long_issued[3]) {

        if (ui == UI_DASH || ui == UI_COUNTDOWN){
            static uint32_t cd_last_inc = 0;

            if (ui == UI_DASH) {
                ui = UI_COUNTDOWN;
                screenNeedsRefresh = true;
            }

            show_countdown();

            if (now - cd_last_inc >= COUNTDOWN_INC_MS) {
                cd_last_inc = now;
                edit_countdown_min++;
                countdownDuration = edit_countdown_min * 60;
                show_countdown();
            }
            return;
        }

        if (now - last_repeat_time >= CONTINUOUS_STEP_MS) {
            last_repeat_time = now;

            if (ui == UI_MENU){
                if (menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
            }
            else if (ui == UI_TIMER_SLOT_SELECT){
                if (currentSlot < 5) currentSlot++;
                if (currentSlot < 2) timer_page = 0;
                else if (currentSlot < 5) timer_page = 1;
                else timer_page = 2;
            }
            else {
                decrease_edit_value();
            }

            screenNeedsRefresh = true;
        }
    }

    /* ------------------- NO BUTTON EVENT ------------------- */
    if (b == BTN_NONE)
        return;

    refreshInactivityTimer();

    /* ============================
       MENU OPEN → LOCKED MODE
       ============================ */

    bool menu_open =
        (ui == UI_MENU ||
         ui == UI_TIMER_SLOT_SELECT ||
         ui == UI_TIMER_EDIT_SLOT_ON_H ||
         ui == UI_TIMER_EDIT_SLOT_ON_M ||
         ui == UI_TIMER_EDIT_SLOT_OFF_H ||
         ui == UI_TIMER_EDIT_SLOT_OFF_M ||
         ui == UI_TIMER_EDIT_SLOT_DAYS ||
         ui == UI_TIMER_EDIT_SLOT_ENABLE ||
         ui == UI_AUTO_MENU ||
         ui == UI_AUTO_EDIT_GAP ||
         ui == UI_AUTO_EDIT_MAXRUN ||
         ui == UI_AUTO_EDIT_RETRY ||
         ui == UI_TWIST ||
         ui == UI_TWIST_EDIT_ON ||
         ui == UI_TWIST_EDIT_OFF ||
         ui == UI_TWIST_EDIT_ON_H ||
         ui == UI_TWIST_EDIT_ON_M ||
         ui == UI_TWIST_EDIT_OFF_H ||
         ui == UI_TWIST_EDIT_OFF_M ||
         ui == UI_COUNTDOWN_EDIT_MIN ||
         (ui >= UI_SETTINGS_GAP && ui <= UI_SETTINGS_FACTORY));

    /* ------------------- EDITING MODE ------------------- */

    bool editing =
        (ui == UI_TIMER_EDIT_SLOT_ON_H ||
         ui == UI_TIMER_EDIT_SLOT_ON_M ||
         ui == UI_TIMER_EDIT_SLOT_OFF_H ||
         ui == UI_TIMER_EDIT_SLOT_OFF_M ||
         ui == UI_AUTO_EDIT_GAP ||
         ui == UI_AUTO_EDIT_MAXRUN ||
         ui == UI_AUTO_EDIT_RETRY ||
         ui == UI_TWIST_EDIT_ON ||
         ui == UI_TWIST_EDIT_OFF ||
         ui == UI_TWIST_EDIT_ON_H ||
         ui == UI_TWIST_EDIT_ON_M ||
         ui == UI_TWIST_EDIT_OFF_H ||
         ui == UI_TWIST_EDIT_OFF_M ||
         ui == UI_COUNTDOWN_EDIT_MIN ||
         (ui >= UI_SETTINGS_GAP && ui <= UI_SETTINGS_FACTORY));

    /* ---------------- EDITING HANDLER ---------------- */

    if (menu_open && editing)
    {
        switch(b){
            case BTN_UP:        increase_edit_value(); break;
            case BTN_UP_LONG:   last_repeat_time = now; increase_edit_value(); break;

