Amiya200/stm32_water_tank/Core/Src/screen.c
            case BTN_DOWN:      decrease_edit_value(); break;
            case BTN_DOWN_LONG: last_repeat_time = now; decrease_edit_value(); break;

            case BTN_SELECT:    menu_select(); break;

            case BTN_RESET:     ui = UI_MENU; break;

            default: break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ---------------- MENU NAVIGATION ---------------- */

    if (menu_open && ui == UI_MENU){
        switch(b){
            case BTN_UP:
                if(menu_idx > 0) menu_idx--;
                break;

            case BTN_DOWN:
                if(menu_idx < MAIN_MENU_COUNT-1) menu_idx++;
                break;

            case BTN_SELECT:
                menu_select();
                break;

            case BTN_RESET:
                ui = UI_DASH;
                break;
        }
        screenNeedsRefresh = true;
        return;
    }

    /* ---------------- TIMER SLOT SELECT ---------------- */

    if (menu_open && ui == UI_TIMER_SLOT_SELECT){
        switch(b){
            case BTN_UP:
                if (currentSlot > 0) currentSlot--;
                if (currentSlot < 2) timer_page = 0;
                else if (currentSlot < 5) timer_page = 1;
                else timer_page = 2;
                break;

            case BTN_DOWN:
                if (currentSlot < 5) currentSlot++;
                if (currentSlot < 2) timer_page = 0;
                else if (currentSlot < 5) timer_page = 1;
                else timer_page = 2;
                break;

           	case BTN_SELECT:
                menu_select();
                break;

            case BTN_RESET:
                ui = UI_MENU;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ---------------- DAYS SELECTION ---------------- */

    if (menu_open && ui == UI_TIMER_EDIT_SLOT_DAYS){
        switch(b){
            case BTN_UP:
            case BTN_UP_LONG:
                edit_timer_dayIndex = (edit_timer_dayIndex + 1) % 7;
                break;

            case BTN_DOWN:
            case BTN_DOWN_LONG:
                edit_timer_dayMask ^= (1u << edit_timer_dayIndex);
                break;

            case BTN_SELECT:
                menu_select();
                break;

            case BTN_RESET:
                ui = UI_TIMER_SLOT_SELECT;
                break;

            default:
                break;
        }
        screenNeedsRefresh = true;
        return;
    }

    /* ---------------- ENABLE/DISABLE SLOT ---------------- */

    if (menu_open && ui == UI_TIMER_EDIT_SLOT_ENABLE){
        switch(b){
            case BTN_UP:
            case BTN_DOWN:
            case BTN_UP_LONG:
            case BTN_DOWN_LONG:
                edit_timer_enabled = !edit_timer_enabled;
                break;

            case BTN_SELECT:
                apply_timer_settings();
                ui = UI_TIMER_SLOT_SELECT;
                break;

            case BTN_RESET:
                ui = UI_TIMER_SLOT_SELECT;
                break;

            default:
                break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ---------------- SETTINGS FLOW ---------------- */

    if (menu_open && (ui >= UI_SETTINGS_GAP && ui <= UI_SETTINGS_FACTORY)){
        switch(b){
            case BTN_UP:        increase_edit_value(); break;
            case BTN_DOWN:      decrease_edit_value(); break;
            case BTN_UP_LONG:   last_repeat_time = now; increase_edit_value(); break;
            case BTN_DOWN_LONG: last_repeat_time = now; decrease_edit_value(); break;

            case BTN_SELECT:    advance_settings_flow(); break;

            case BTN_RESET:     ui = UI_MENU; break;

            default: break;
        }

        screenNeedsRefresh = true;
        return;
    }

    /* ============================================================
       BELOW: NORMAL MODE (Menu closed)
       ============================================================ */

    switch(b)
    {
        /* ------------ SW1 RESET ------------ */
        case BTN_RESET:
            reset();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_RESET_LONG:
            ModelHandle_ToggleManual();
            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* ------------ SW2 SELECT ------------ */
        case BTN_SELECT:
            if(countdownActive){
                ModelHandle_StopCountdown();
                ui = UI_DASH;
                screenNeedsRefresh = true;
                return;
            }

            if(!autoActive)
                ModelHandle_StartAuto(edit_auto_gap_s, edit_auto_maxrun_min, edit_auto_retry);
            else
                ModelHandle_StopAuto();

            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_SELECT_LONG:
            ui = UI_MENU;
            goto_menu_top();
            screenNeedsRefresh = true;
            return;

        /* ------------ SW3 UP ------------ */
        case BTN_UP:
            if(!timerActive)
                ModelHandle_StartTimerNearestSlot();
            else
                ModelHandle_StopTimer();

            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        case BTN_UP_LONG:
            if(!semiAutoActive)
                ModelHandle_StartSemiAuto();
            else
                ModelHandle_StopSemiAuto();

            ui = UI_DASH;
            screenNeedsRefresh = true;
            return;

        /* ------------ SW4 DOWN ------------ */
        case BTN_DOWN:
            if(!countdownActive){
                ModelHandle_StartCountdown(edit_countdown_min * 60);
                ui = UI_COUNTDOWN;
            } else {
                ModelHandle_StopCountdown();
                ui = UI_DASH;
            }
            screenNeedsRefresh = true;
            return;

