Amiya200/stm32_water_tank/Core/Src/screen.c
        case BTN_DOWN_LONG:
            last_repeat_time = now;
            return;

        default:
            return;
    }
}
/***************************************************************
 *  SCREEN.C — PART E / 6
 *  LCD Update Engine + UI Dispatcher + Cursor Blink
 ***************************************************************/

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();

    /* ============================================================
       CURSOR BLINK (ONLY FOR MAIN MENU)
       ============================================================ */
    bool cursorBlinkActive = (ui == UI_MENU);

    if (cursorBlinkActive && (now - lastCursorToggle >= CURSOR_BLINK_MS))
    {
        cursorVisible = !cursorVisible;
        lastCursorToggle = now;
        draw_menu_cursor();   // Only draw the '>' cursor, no flicker
    }

    /* ============================================================
       AUTO TRANSITION FROM WELCOME → DASH
       ============================================================ */
    if (ui == UI_WELCOME && now - lastLcdUpdateTime >= WELCOME_MS)
    {
        ui = UI_DASH;
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       AUTO-RETURN TO DASH AFTER 60 SECONDS INACTIVITY
       ============================================================ */
    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        now - lastUserAction >= AUTO_BACK_MS)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       DASHBOARD AUTO-REFRESH EVERY 1 SECOND
       ============================================================ */
    if ((ui == UI_DASH || ui == UI_COUNTDOWN) &&
        now - lastLcdUpdateTime >= 1000)
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* ============================================================
       IF UI CHANGED OR REFRESH FLAG SET → REDRAW LCD
       ============================================================ */
    if (screenNeedsRefresh || ui != last_ui)
    {
        bool fullRefresh = (ui != last_ui);
        last_ui = ui;
        screenNeedsRefresh = false;

        if (fullRefresh)
            lcd_clear();

        /* ------------------------
           UI DISPATCHER
           ------------------------ */
        switch(ui)
        {
            /* ======== WELCOME / DASH ======== */
            case UI_WELCOME:
                show_welcome();
                break;

            case UI_DASH:
                show_dash();
                break;

            /* ======== MAIN MENU ======== */
            case UI_MENU:
                show_menu();
                break;

            /* ======== TIMER SLOT UI ======== */
            case UI_TIMER_SLOT_SELECT:
                show_timer_slot_select();
                break;

            case UI_TIMER:
                show_timer();
                break;

            case UI_TIMER_EDIT_SLOT_ON_H:
                show_timer_on_h();
                break;

            case UI_TIMER_EDIT_SLOT_ON_M:
                show_timer_on_m();
                break;

            case UI_TIMER_EDIT_SLOT_OFF_H:
                show_timer_off_h();
                break;

            case UI_TIMER_EDIT_SLOT_OFF_M:
                show_timer_off_m();
                break;

            case UI_TIMER_EDIT_SLOT_DAYS:
                show_timer_days();
                break;

            case UI_TIMER_EDIT_SLOT_ENABLE:
                show_timer_enable();
                break;

            /* ======== AUTO MODE UI ======== */
            case UI_AUTO_MENU:
                show_auto_menu();
                break;

            case UI_AUTO_EDIT_GAP:
                show_auto_gap();
                break;

            case UI_AUTO_EDIT_MAXRUN:
                show_auto_maxrun();
                break;

            case UI_AUTO_EDIT_RETRY:
                show_auto_retry();
                break;

            /* ======== TWIST MODE UI ======== */
            case UI_TWIST:
                show_twist();
                break;

            case UI_TWIST_EDIT_ON:
                show_twist_on_sec();
                break;

            case UI_TWIST_EDIT_OFF:
                show_twist_off_sec();
                break;

            case UI_TWIST_EDIT_ON_H:
                show_twist_on_h();
                break;

            case UI_TWIST_EDIT_ON_M:
                show_twist_on_m();
                break;

            case UI_TWIST_EDIT_OFF_H:
                show_twist_off_h();
                break;

            case UI_TWIST_EDIT_OFF_M:
                show_twist_off_m();
                break;

            /* ======== COUNTDOWN UI ======== */
            case UI_COUNTDOWN:
                show_countdown();
                break;

            case UI_COUNTDOWN_EDIT_MIN:
                show_countdown_edit_min();
                break;

            /* ======== SETTINGS UI (OPTION-B LINEAR FLOW) ======== */
            case UI_SETTINGS_GAP:
                show_settings_gap();
                break;

            case UI_SETTINGS_RETRY:
                show_settings_retry();
                break;

            case UI_SETTINGS_UV:
                show_settings_uv();
                break;

            case UI_SETTINGS_OV:
                show_settings_ov();
                break;

            case UI_SETTINGS_OL:
                show_settings_ol();
                break;

            case UI_SETTINGS_UL:
                show_settings_ul();
                break;

            case UI_SETTINGS_MAXRUN:
                show_settings_maxrun();
                break;

            case UI_SETTINGS_FACTORY:
                show_settings_factory();
                break;

            /* ======== DEFAULT (FALLBACK) ======== */
            default:
                break;
        }
    }
}
/***************************************************************
 *  SCREEN.C — PART F / 6 (CLEAN VERSION)
 *  Only missing externs needed for linking
 ***************************************************************/

/* ================================================================
   ONLY DECLARE FUNCTIONS THAT DO NOT ALREADY EXIST IN HEADER
   ================================================================ */

extern void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint16_t retry);
extern void ModelHandle_StartTimerNearestSlot(void);
extern void ModelHandle_StopTimer(void);
extern void ModelHandle_StopSemiAuto(void);

/* Factory Reset (if available) */
extern void ModelHandle_FactoryReset(void);

/* ================================================================
   DO NOT DEFINE VARIABLES HERE — THEY WERE ALREADY DEFINED ABOVE
   (static uint16_t edit_settings_gap_s ... etc)
   ================================================================ */

